---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallAttrDefheightParam
source: html/4bd940cc-7bce-1f17-34b8-bda5ddd01054.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallAttrDefheightParam Property

"Default height"

## Syntax (C#)
```csharp
public static ForgeTypeId WallAttrDefheightParam { get; }
```